/**
 * Date객체에 저장되어 있는 날짜에서 파라미터로 전달된 날짜까지 몇일이 남았는지를 계산하여 리턴해 준다.
 * 함수 내부에서 월 값을 -1로 계산하므로, 파라미터는 1~12사이의 값을 전달한다
 *
 * @params 	y - 년도
 * @params 	m - 월
 * @params 	d - 일
 */
/*
 *
 *
 *
 * 여기에 작성하세요.
 *
 *
 *
 */

/**
 * Date객체에 저장되어 있는 날짜의 요일 이름을 리턴한다.
 */
/*
 *
 *
 *
 * 여기에 작성하세요.
 *
 *
 *
 */

/**
 * Date객체에 저장되어 있는 날짜를 "yyyy-mm-dd hh:mi:ss" 형식으로 리턴한다.
 */
/*
 *
 *
 *
 * 여기에 작성하세요.
 *
 *
 *
 */

/**
 * Date객체에 저장되어 있는 날짜를 "yyyymmddhhmiss" 형식으로 리턴한다.
 */
/*
 *
 *
 *
 * 여기에 작성하세요.
 *
 *
 *
 */

/**
 * 날짜 계산기.
 * @params 	op - 두 번째 파라미터는 계산할 단위값이다.
 * 							 y(년도 계산), m(월 계산), d(날짜 계산), h(시간 계산), i(분 계산), s(초 계산)
 * @params 	value - 계산을 위한 값으로서 양수, 음수 모두 허용된다.
 */
/*
 *
 *
 *
 * 여기에 작성하세요.
 *
 *
 *
 */

/**
 * 날짜 계산에 의하여 변경된 값을 시스템의 오늘 날짜로 재설정
 */
/*
 *
 *
 *
 * 여기에 작성하세요.
 *
 *
 *
 */

